<a href="https://colab.research.google.com/github/zzambbang/prgrms-de/blob/main/(DE_6%EA%B8%B0_3%EC%A3%BC%EC%B0%A8)_SQL_%EC%8B%A4%EC%8A%B5_%EC%9D%B4%ED%98%9C%EC%A7%80.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Set up Configuration

In [1]:
%load_ext sql

In [2]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://zzambbang:Zzambbang!1@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: zzambbang@dev'

# **이후 아래 SQL에서 "keeyong"을 자신의 스키마로 변경**

다양한 SELECT 실행해보기

In [3]:
%%sql

SELECT *
FROM raw_data.user_session_channel
LIMIT 10;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(184, 'c41dd99a69df04044aa4e33ece9c9249', 'Naver'),
 (251, '0a54b19a13b6712dc04d1b49215423d8', 'Facebook'),
 (744, '05ae14d7ae387b93370d142d82220f1b', 'Facebook'),
 (265, '4c4ea5258ef3fb3fb1fc48fee9b4408c', 'Naver'),
 (45, '60131a2a3f223dc8f4753bcc5771660c', 'Youtube'),
 (262, '761efc843ff05ab74ed358713dd51c1b', 'Organic'),
 (702, '8c97dbeee3b0d40ced7f514b99a93d93', 'Instagram'),
 (113, '7f2cba89a7116c7c6b0a769572d5fad9', 'Organic'),
 (788, 'a8c6dd982010fce8701ce1aef8a2d40a', 'Google'),
 (645, '593906af0d138e69f49d251d3e7cbed0', 'Youtube')]

In [4]:
%%sql

SELECT DISTINCT channel                      -- 유일한 채널 이름을 알고 싶은 경우
FROM raw_data.user_session_channel;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[('Naver',),
 ('Facebook',),
 ('Youtube',),
 ('Instagram',),
 ('Organic',),
 ('Google',)]

In [5]:
%%sql

SELECT COUNT(1)                    -- 테이블의 모든 레코드 수 카운트. COUNT(*). 하나의 레코드
FROM raw_data.user_session_channel;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

### 비어 있는 테이블 만들고 레코드 추가하고 COUNT하기

In [6]:
%%sql

DROP TABLE IF EXISTS zzambbang.test_table;
CREATE TABLE zzambbang.test_table (
    value int
);

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [7]:
%%sql

INSERT INTO zzambbang.test_table VALUES (NULL), (1), (1), (0), (0), (4), (3);

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[]

In [8]:
%%sql

SELECT * FROM zzambbang.test_table;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(None,), (1,), (1,), (0,), (0,), (4,), (3,)]

아래 COUNT 문들의 결과값은 얼마일까?

In [9]:
%%sql

SELECT COUNT(1), COUNT(value), COUNT(DISTINCT value)
FROM zzambbang.test_table;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(7, 6, 4)]

### Primary Key 이해해보기와 Data Quality 검사해보기

In [10]:
%%sql

DROP TABLE IF EXISTS zzambbang.test_channel;
CREATE TABLE zzambbang.test_channel (
   channel varchar(32) primary key,
   description varchar(64) default 'test'
);

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [11]:
%%sql

INSERT INTO zzambbang.test_channel VALUES ('FACEBOOK', 'test'), ('GOOGLE', 'test');

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[]

In [12]:
%%sql

SELECT * FROM zzambbang.test_channel;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('FACEBOOK', 'test'), ('GOOGLE', 'test')]

In [13]:
%%sql

INSERT INTO zzambbang.test_channel VALUES ('FACEBOOK'), ('GOOGLE');

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[]

In [14]:
%%sql

SELECT * FROM zzambbang.test_channel;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
4 rows affected.

[('FACEBOOK', 'test'),
 ('GOOGLE', 'test'),
 ('FACEBOOK', 'test'),
 ('GOOGLE', 'test')]

In [15]:
%%sql

SELECT DISTINCT * FROM zzambbang.test_channel;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('FACEBOOK', 'test'), ('GOOGLE', 'test')]

필드 이름 변경해보기

In [16]:
%%sql

ALTER TABLE zzambbang.test_channel RENAME channel to channelname;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.

[]

중복 레코드 확인해보기

In [17]:
%%sql

SELECT COUNT(1) FROM zzambbang.test_channel;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(4,)]

In [19]:
%%sql

SELECT COUNT(1) FROM (
    SELECT DISTINCT * FROM zzambbang.test_channel
);

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(2,)]

primary key uniqueness 확인해보기

In [20]:
%%sql

SELECT channelname, count(1)
FROM zzambbang.test_channel
GROUP BY 1
ORDER BY 2 DESC
LIMIT 5;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('FACEBOOK', 2), ('GOOGLE', 2)]

타임 스탬프 필드가 있다면 최근에도 업데이트된 레코드가 있는지 꼭 확인. 언제부터 레코드가 생성되었는지도 확인. 월별로 레코드수를 확인해보는 것도 좋은 버릇

In [21]:
%%sql

SELECT MAX(ts), MIN(ts)
FROM raw_data.session_timestamp;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(datetime.datetime(2019, 11, 30, 23, 58, 23), datetime.datetime(2019, 5, 1, 0, 13, 11, 783000))]

### CASE WHEN을 사용해보기

In [22]:
%%sql

SELECT LEFT(ts, 7), COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-08', 17151),
 ('2019-11', 18059),
 ('2019-05', 6261),
 ('2019-06', 10520),
 ('2019-07', 14840),
 ('2019-09', 15790),
 ('2019-10', 18899)]

월별로 10000 혹은 그 이상 세션이면 ">= 10,000" 아니면 "< 10,000" 이렇게 찍어보기

In [23]:
%%sql

SELECT LEFT(ts, 7), CASE WHEN COUNT(1) >= 10000 THEN '>= 10,000' ELSE '< 10,000' END
FROM raw_data.session_timestamp
GROUP BY 1;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-08', '>= 10,000'),
 ('2019-11', '>= 10,000'),
 ('2019-05', '< 10,000'),
 ('2019-06', '>= 10,000'),
 ('2019-07', '>= 10,000'),
 ('2019-09', '>= 10,000'),
 ('2019-10', '>= 10,000')]

월별로 15000 혹은 그 이상 세션이면 ">= 15,000", 10000보다 작으면 "< 10,000", 그 사이이면 "10000 and 15000" 이렇게 찍어보기

In [24]:
%%sql

SELECT
    LEFT(ts, 7),
    CASE 
        WHEN COUNT(1) >= 15000 THEN '>= 15,000'
        WHEN COUNT(1) < 10000 THEN '< 10,000'
        ELSE '10000 and 15000'
    END
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 1;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', '< 10,000'),
 ('2019-06', '10000 and 15000'),
 ('2019-07', '10000 and 15000'),
 ('2019-08', '>= 15,000'),
 ('2019-09', '>= 15,000'),
 ('2019-10', '>= 15,000'),
 ('2019-11', '>= 15,000')]

### 공백이 들어있는 필드이름 혹은 예약된 키워드를 필드이름으로 사용하려면?

In [25]:
%%sql

DROP TABLE IF EXISTS keeyong.test;
CREATE TABLE keeyong.test (
    group int primary key,
    'mailing address' varchar(32)
);

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
(psycopg2.ProgrammingError) permission denied for schema keeyong

[SQL: DROP TABLE IF EXISTS keeyong.test;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [27]:
%%sql

CREATE TABLE zzambbang.test (
    "group" int primary key,
    "mailing address" varchar(32)
);

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.

[]

In [28]:
%%sql

SELECT "group"
FROM zzambbang.test;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
0 rows affected.

[]

### 다양한 WHERE clause 사용해보기

WHERE에서 "in"을 사용한 clause 사용해보기

In [29]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel in ('Google','Facebook');  -- not in

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(33773,)]

In [30]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel like '%oo%';   -- not like

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(33773,)]

In [31]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel like 'F%';

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(16791,)]

In [32]:
%%sql

SELECT COUNT(1)
FROM raw_data.session_timestamp
WHERE ts BETWEEN '2019-05-01' and '2019-06-01';

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(6261,)]

### NULL과 TRUE/FALSE 이해하기

In [35]:
%%sql

SELECT COUNT(1)
FROM zzambbang.test_table
WHERE value is NULL; -- primary key로 지정된 필드에 꼭 해보는 것이 좋음. WHERE value != NULL이 아님. IS NULL의 반대는 IS NOT NULL
--NULL 값 비교할때는 is 로 해야함 = 이건 안됨

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(1,)]

기본적으로 필드는 NULL 값을 가질 수 있음. 만일 어느 필드의 값이 NULL이 될 수 없다면 CREATE TABLE 실행시 지정가능

In [36]:
%%sql

DROP TABLE IF EXISTS zzambbang.test_null;
CREATE TABLE zzambbang.test_null ()
    value int NOT NULL -- 선언할때 Null값이 안된다고 했는데 이렇게 하니까 에러가 난다
);

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
(psycopg2.ProgrammingError) syntax error at or near "value"
LINE 2:     value int NOT NULL
            ^

[SQL: CREATE TABLE zzambbang.test_null ()
    value int NOT NULL
);]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [37]:
%%sql

INSERT INTO zzambbang.test_null VALUES (NULL);

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
(psycopg2.ProgrammingError) relation "zzambbang.test_null" does not exist

[SQL: INSERT INTO zzambbang.test_null VALUES (NULL);]
(Background on this error at: https://sqlalche.me/e/14/f405)

Boolean 필터링과 NULL과의 관계

In [38]:
%%sql

DROP TABLE IF EXISTS zzambbang.test_boolean;
CREATE TABLE zzambbang.test_boolean (
    value boolean 
)

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [39]:
%%sql

INSERT INTO zzambbang.test_boolean VALUES (True), (False), (True), (True), (True), (NULL);

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[]

In [40]:
%%sql

SELECT * FROM zzambbang.test_boolean;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[(True,), (False,), (True,), (True,), (True,), (None,)]

In [41]:
%%sql

SELECT COUNT(1) FROM zzambbang.test_boolean WHERE value = False;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(1,)]

In [42]:
%%sql

SELECT COUNT(1) FROM zzambbang.test_boolean WHERE value is not True;
-- null 과 False 두가지가 count 된것이다

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(2,)]

NULL이 들어간 경우의 연산은?

In [43]:
%%sql

SELECT COUNT(NULL);

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(0,)]

In [44]:
%%sql

SELECT 1/NULL;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(None,)]

In [45]:
%%sql

SELECT 0+NULL;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(None,)]

### COALESCE, NULLIF

In [47]:
%%sql
-- 에러가 남. 0이 잇거든 ...
SELECT 100/value
FROM zzambbang.test_table;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
(psycopg2.extensions.QueryCanceledError) Divide by zero

[SQL: -- 에러가 남. 0이 잇거든 ...
SELECT 100/value
FROM zzambbang.test_table;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [48]:
%%sql
-- nullif 를 쓰면 됨. nullif는 뒤에 나오는 두개의 값이 나오면 null이 리턴이 나오고 두개의 값이 다르면 그대로 리턴이 된다.
SELECT value, 100/NULLIF(value, 0)
FROM zzambbang.test_table;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(None, None), (1, 100), (1, 100), (0, None), (0, None), (4, 25), (3, 33)]

In [50]:
%%sql
--coalesce 는 nullif와 비슷하지만, null이 아닌 인자가 나올때까지 쭉 따라가던지, 끝까지 갓는데도 안나오면 Null을 리턴
SELECT value, COALESCE(value, 1) -- NULL인 경우 1을 대신 사용하고 싶다면
FROM zzambbang.test_table;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(None, 1), (1, 1), (1, 1), (0, 0), (0, 0), (4, 4), (3, 3)]

세션이 가장 많이 생성된 시간대는?

In [51]:
%%sql

SELECT EXTRACT(HOUR FROM ts), COUNT(1) as session_count
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;

 * postgresql://zzambbang:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(15, 15339)]

가장 많이 사용된 채널은 무엇인가?

In [ ]:
%%sql

SELECT
    channel,
    COUNT(1) AS session_count,
    COUNT(DISTINCT userId) AS user_count
FROM raw_data.user_session_channel
GROUP BY 1                         -- GROUP BY channel
ORDER BY 2 DESC;              -- ORDER BY session_count DESC

가장 많은 세션을 만들어낸 사용자 ID는 무엇인가?

In [ ]:
%%sql

SELECT
    userId,
    COUNT(1) AS count
FROM raw_data.user_session_channel
GROUP BY 1                         -- GROUP BY userId
ORDER BY 2 DESC              -- ORDER BY count DESC
LIMIT 1;

월별 채널별 유니크한 사용자 수

In [ ]:
%%sql

SELECT 
  TO_CHAR(A.ts, 'YYYY-MM') AS month,
  channel,
  COUNT(DISTINCT B.userid) AS mau
FROM raw_data.session_timestamp A
JOIN raw_data.user_session_channel B ON A.sessionid = B.sessionid
GROUP BY 1, 2      
ORDER BY 1 DESC, 2;

### 요약 테이블을 CTAS (Create Table 이름 As SELECT)로 생성해보기

In [ ]:
%%sql

CREATE TABLE keeyong.monthly_active_user_summary AS 
SELECT TO_CHAR(ts, 'YYYY-MM') AS month, COUNT(DISTINCT userid)
FROM raw_data.user_session_channel A
JOIN raw_data.session_timestamp B ON A.sessionid = B.sessionid
GROUP BY 1
ORDER BY 1 DESC;

In [ ]:
%%sql

SELECT * FROM keeyong.monthly_active_user_summary;

In [ ]:
%%sql

DROP TABLE keeyong.monthly_active_user_summary;

In [ ]:
%%sql

SELECT EXTRACT(HOUR FROM ts), COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;

In [ ]:
%%sql

SELECT EXTRACT(DOW FROM ts), COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;

In [ ]:
%%sql

SELECT EXTRACT(DOW FROM ts), EXTRACT(HOUR FROM ts), COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1, 2
ORDER BY 3 DESC
LIMIT 1;

In [ ]:
%%sql

SELECT ts, channel
FROM raw_data.user_session_channel usc
JOIN raw_data.session_timestamp st ON usc.sessionid = st.sessionid
WHERE userid = 251
ORDER BY 1;

### UNION과 UNION ALL 차이점 이해하기

In [ ]:
%%sql
--중복처리를 알아서 해준다
SELECT 'keeyong' as first_name, 'han' as last_name

UNION

SELECT 'elon', 'musk'

UNION

SELECT 'keeyong', 'han'

In [ ]:
%%sql
--union all 하면 중복처리안하고 나온다
SELECT 'keeyong' as first_name, 'han' as last_name

UNION ALL

SELECT 'elon', 'musk'

UNION ALL

SELECT 'keeyong', 'han'

## JOIN:

An SQL JOIN clause is used to combine rows from two or more tables, based on a common field between them.

왼쪽 테이블을 LEFT라고 하고 오른쪽 테이블을 RIGHT이라고 하자. JOIN의 결과는 방식에 상관없이 양쪽의 필드를 모두 가진 새로운 테이블을 만들어내게 됨. 조인의 방식에 따라 다음 두 가지가 달라짐:

1. 어떤 레코드들이 선택되는지?
2. 어떤 필드들이 채워지는지?

In [ ]:
%%sql

DROP TABLE IF EXISTS keeyong.vital;
CREATE TABLE keeyong.vital (
    UserID int,
    VitalID	int,
    Date date,
    Weight int
);
INSERT INTO keeyong.vital VALUES
(100,	1, '2020-01-01', 75),
(100, 3, '2020-01-02', 78),
(101, 2, '2020-01-01', 90),
(101, 4, '2020-01-02', 95);

In [ ]:
%%sql

DROP TABLE IF EXISTS keeyong.alert;
CREATE TABLE keeyong.alert (
    AlertID int,
    VitalID	int,
    AlertType varchar(32),
    Date date,
    UserID int
);
INSERT INTO keeyong.alert VALUES
 (1,	4, 'WeightIncrease', '2020-01-01', 101),
 (2, NULL, 'MissingVital', '2020-01-04', 100),
 (3, NULL, 'MissingVital', '2020-01-04', 101);

* INNER JOIN
1. 양쪽 테이블에서 매치가 되는 레코드들만 리턴함
2. 양쪽 테이블의 필드가 모두 채워진 상태로 리턴됨

In [ ]:
%%sql

SELECT * FROM keeyong.Vital v
JOIN keeyong.Alert a ON v.vitalID = a.vitalID;

* LEFT JOIN: 
1. 왼쪽 테이블의 레코드는 모두 리턴되며 오른쪽 테이블과 매칭이 되는 레코드들의 경우에는 오른쪽 테이블 레코드들의 컬럼들이 채워진 상태로 리턴됨.
2. 매칭이 안되는 왼쪽 테이블 레코드들은 오른쪽 테이블에서 들어오는 필드들은 NULL로 채워짐

In [ ]:
%%sql

SELECT * FROM keeyong.Vital v
LEFT JOIN keeyong.Alert a ON v.vitalID = a.vitalID;

* FULL JOIN (OUTER JOIN):
1. 왼쪽 테이블과 오른쪽 테이블의 모든 레코드들을 리턴함
2. 매칭되는 경우에만 양쪽 테이블들의 모든 필드들이 채워진 상태로 리턴됨

In [ ]:
%%sql

SELECT * FROM keeyong.Vital v
FULL JOIN keeyong.Alert a ON v.vitalID = a.vitalID;

* CARTESIAN JOIN (CROSS JOIN): 
1. 조인 조건 없이 두 개 테이블의 내용을 모두 조합한 결과 레코드들을 생성

In [ ]:
%%sql

SELECT *
FROM (
    SELECT vitalid  -- 1,2,3,4
    FROM keeyong.vital
)
CROSS JOIN (
    SELECT alertid   -- 1,2,3
    FROM keeyong.alert
);

In [ ]:
%%sql

SELECT * FROM keeyong.Vital v
CROSS JOIN keeyong.Alert a;

* Self-Join

In [ ]:
%%sql

SELECT * FROM keeyong.Vital v1
JOIN keeyong.Vital v2 ON v1.vitalID = v2.vitalID;